---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorPosition
source: html/883645dc-2e29-663e-00ad-84a32621482c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorPosition

Defines vector position for vector settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleVectorPosition
```